# ElectricalPhaseConfiguration Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DistributionSysType..::..ElectricalPhaseConfiguration Property
DistributionSysType Class See Also
---
Get or set electrical phase configuration (Y, delta or undefined) of distribution system.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public ElectricalPhaseConfiguration ElectricalPhaseConfiguration { get; set; }
```

Visual Basic
---
```text
Public Property ElectricalPhaseConfiguration As ElectricalPhaseConfiguration
	Get
	Set
```

Visual C++
---
```text
public:
property ElectricalPhaseConfiguration ElectricalPhaseConfiguration {
	ElectricalPhaseConfiguration get ();
	void set (ElectricalPhaseConfiguration value);
}
```

# See Also
DistributionSysType Class
Autodesk.Revit.DB.Electrical Namespace